In [1]:
data = {'Name': ['John', 'Tim', 'Rob'], 
        'Age': [34, 23, 22],
        'Salary': [4500, 2300, 5800]}

In [3]:
from pandas import DataFrame
frame = DataFrame(data)

In [4]:
frame

   Name  Age  Salary
0  John   34    4500
1   Tim   23    2300
2   Rob   22    5800